In [9]:
import pandas as pd
import numpy as np

import os
print(r"C:\Users\ASUS\Desktop\ml\KNN algrothim")

C:\Users\ASUS\Desktop\ml\KNN algrothim

In [10]:
df = pd.read_csv(r"C:\Users\ASUS\Desktop\ml\KNN algrothim\Placement_Data_Full_Class.csv")

# Select specific columns/features
features = ["hsc_p", "ssc_p", "salary"]
X = df[features]

In [11]:
df.info

<bound method DataFrame.info of      sl_no gender  ssc_p    ssc_b  hsc_p    hsc_b     hsc_s  degree_p  \
0        1      M  67.00   Others  91.00   Others  Commerce     58.00
1        2      M  79.33  Central  78.33   Others   Science     77.48
2        3      M  65.00  Central  68.00  Central      Arts     64.00
3        4      M  56.00  Central  52.00  Central   Science     52.00
4        5      M  85.80  Central  73.60  Central  Commerce     73.30
..     ...    ...    ...      ...    ...      ...       ...       ...
210    211      M  80.60   Others  82.00   Others  Commerce     77.60
211    212      M  58.00   Others  60.00   Others   Science     72.00
212    213      M  67.00   Others  67.00   Others  Commerce     73.00
213    214      F  74.00   Others  66.00   Others  Commerce     58.00
214    215      M  62.00  Central  58.00   Others   Science     53.00

      degree_t workex  etest_p specialisation  mba_p      status    salary
0     Sci&Tech     No     55.0         Mkt&HR  58.80      Placed  270000.0
1     Sci&Tech    Yes     86.5        Mkt&Fin  66.28      Placed  200000.0
2    Comm&Mgmt     No     75.0        Mkt&Fin  57.80      Placed  250000.0
3     Sci&Tech     No     66.0         Mkt&HR  59.43  Not Placed       NaN
4    Comm&Mgmt     No     96.8        Mkt&Fin  55.50      Placed  425000.0
..         ...    ...      ...            ...    ...         ...       ...
210  Comm&Mgmt     No     91.0        Mkt&Fin  74.49      Placed  400000.0
211   Sci&Tech     No     74.0        Mkt&Fin  53.62      Placed  275000.0
212  Comm&Mgmt    Yes     59.0        Mkt&Fin  69.72      Placed  295000.0
213  Comm&Mgmt     No     70.0         Mkt&HR  60.23      Placed  204000.0
214  Comm&Mgmt     No     89.0         Mkt&HR  60.22  Not Placed       NaN

[215 rows x 15 columns]>

In [12]:
X.head()

   hsc_p  ssc_p    salary
0  91.00  67.00  270000.0
1  78.33  79.33  200000.0
2  68.00  65.00  250000.0
3  52.00  56.00       NaN
4  73.60  85.80  425000.0

In [20]:
from sklearn.impute import SimpleImputer

my_imputer = SimpleImputer()
x = pd.DataFrame(my_imputer.fit_transform(X))
x.columns =X.columns
y= df["gender"]

In [18]:
x.head()

   hsc_p  ssc_p         salary
0  91.00  67.00  270000.000000
1  78.33  79.33  200000.000000
2  68.00  65.00  250000.000000
3  52.00  56.00  288655.405405
4  73.60  85.80  425000.000000

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [ ]:
from sklearn.neighbors import KNeighborsClassifier

knn = KNegihborsClassifier(n_neighbors=1, metrics='minkowski', weights=
)